
def get_data():

    return f"{input('Введите фамилию: ')} {input('Введите имя: ')} {input('Введите возраст: ')} {input('Введите телефон: ')} {input('Введите должность: ')} {input('Введите зарплата: ')}\n"

def get_number_operasion():
    return input('Выберите номер категории\n \
        где: 1-показать все фамилии\n \
             2-показать все имена\n \
             3-показать возраст\n \
             4-показать сотрудника\n \
             5-показать всю таблицу\n \
             6-показать информацию по сотруднику\n \
             7-добавить сотрудника\n \
             8-выход\n ')  